src/cf/src/InformationRegisters/УчетОборудованияРабочихМест/УчетОборудованияРабочихМест.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетОборудованияРабочихМест</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/InformationRegisters/УчетОборудованияРабочихМест/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Запись.РабочееМесто.Пустая() Тогда
		Запись.Организация = Запись.РабочееМесто.Организация;	
	КонецЕсли;
	
	Если ЭтаФорма.Параметры.Свойство("ИзФормыЭлементаРабочиеМеста") 
		И ЭтаФорма.Параметры.ИзФормыЭлементаРабочиеМеста Тогда
		// Нельзя изменить организацию и рабочее место если из формы элемента рабочего места.
		Элементы.Организация.ТолькоПросмотр = Истина;
		Элементы.РабочееМесто.ТолькоПросмотр = Истина;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если (Не Запись.РабочееМесто.Пустая()) 
		И (Не Запись.Организация.Пустая()) Тогда
		ЭтаФорма.ТекущийЭлемент = Элементы.Номенклатура;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ИзмененУчетОборудования",,Запись);	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	
	Если Не Запись.Номенклатура.Пустая() Тогда
		Запись.Количество = КоличествоНоменклатуры(Запись.Номенклатура);
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция КоличествоНоменклатуры(Номенклатура)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВложенныйЗапрос.Номенклатура.КоличествоХарактеристика - ВложенныйЗапрос.Количество КАК Остаток,
	|	ВложенныйЗапрос.Количество
	|ИЗ
	|	(ВЫБРАТЬ
	|		УчетОборудованияРабочихМест.Номенклатура КАК Номенклатура,
	|		СУММА(УчетОборудованияРабочихМест.Количество) КАК Количество
	|	ИЗ
	|		РегистрСведений.УчетОборудованияРабочихМест КАК УчетОборудованияРабочихМест
	|	
	|	СГРУППИРОВАТЬ ПО
	|		УчетОборудованияРабочихМест.Номенклатура) КАК ВложенныйЗапрос
	|ГДЕ
	|	ВложенныйЗапрос.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
	
		Если Выборка.Остаток < 1 Тогда
			
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Нет свободной номенклатуры! Остаток номенклатуры: %1.'"), Выборка.Остаток);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Возврат 0;
			
		КонецЕсли;
		
		Возврат Выборка.Остаток;
		
	КонецЕсли;
	
	
	Возврат Номенклатура.КоличествоХарактеристика;

КонецФункции

#КонецОбласти
